benchmarks/casesOF/2D/standingCapillaryWave/Cases/mycCartesian/heightFunction/coarse/system/initAlphaFieldDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
field alpha.water;
function functionSin;
period 0.003;
direction (1 0 0);
up (0 0 1);
origin (-7.5e-4 0 0);
phase 0;
//lambda 0.003;
amplitude 0.003;

// ************************************************************************* //
